Revit 2024 API
PickBoxStyle Enumeration
 The enum that controls the style of the pick box.
Namespace: Autodesk.Revit.UI.Selection
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public enum PickBoxStyle
Visual Basic
Public Enumeration PickBoxStyle
Visual C++
public enum class PickBoxStyle
Members
Member name | Description
Crossing |  Draws the box with the style that is used when selecting objects completely or partially inside the box.
Enclosing |  Draws the box with the style that is used when selecting objects that are completely enclosed by the box.
Directional |  The style of the box depends on the direction in which the box is being drawn. It uses the Crossing style if it is being drawn from right to left, or the Enclosing style when drawn in the opposite direction.
See Also
Autodesk.Revit.UI.Selection Namespace